# ModuleSettings Class

---
The module settings.
SystemObject Autodesk.Revit.DB.MacrosModuleSettings
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ModuleSettings : IDisposable

    Public Class ModuleSettings
    	Implements IDisposable

    public ref class ModuleSettings : IDisposable

    type ModuleSettings =
        class
            interface IDisposable
        end
The ModuleSettings type exposes the following members.
| Name| Description
---|---|---
| ModuleSettings|  Constructs a new module settings.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| MacroLanguageType|  The Macro language type.
| Name|  The module name.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the ModuleSettings
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Macros Namespace